`terraform state rm` and `terraform import` did not solve azurerm_storage_container force replacement.

```hcl
  # azurerm_storage_container.tfstate must be replaced
  # (imported from "https://example.blob.core.windows.net/tfstate")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_storage_container" "tfstate" {
        container_access_type             = "private"
      ~ default_encryption_scope          = "$account-encryption-key" -> (known after apply)
        encryption_scope_override_enabled = true
      ~ has_immutability_policy           = false -> (known after apply)
      ~ has_legal_hold                    = false -> (known after apply)
      ~ id                                = "https://example.blob.core.windows.net/tfstate" -> (known after apply)
      ~ metadata                          = {} -> (known after apply)
        name                              = "tfstate"
      ~ resource_manager_id               = "/subscriptions/******resourceGroups/tfstate/providers/Microsoft.Storage/storageAccounts/example/blobServices/default/containers/tfstate" -> (known after apply)
      + storage_account_id                = "/subscriptions/******/resourceGroups/tfstate/providers/Microsoft.Storage/storageAccounts/example" # forces replacement
      - storage_account_name              = "example" -> null # forces replacement
    }

Plan: 1 to import, 1 to add, 0 to change, 1 to destroy.
```